; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
  (:predicates
    (clear ?x)
    (on-table ?x)
    (arm-empty)
    (holding ?x)
    (on ?x ?y)
  )

  (:action pickup
    :parameters (?ob)
    :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
    :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
      (not (arm-empty)))
  )

  (:action putdown
    :parameters (?ob)
    :precondition (holding ?ob)
    :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
      (not (holding ?ob)))
  )

  (:action stack
    :parameters (?ob ?underob)
    :precondition (and (clear ?underob) (holding ?ob))
    :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
      (not (clear ?underob)) (not (holding ?ob)))
  )

  (:action unstack
    :parameters (?ob ?underob)
    :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
    :effect (and (holding ?ob) (clear ?underob)
      (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))
  )
)

; problem
(define (problem BW-rand-22)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 )
(:init
(arm-empty)
(on b1 b5)
(on-table b2)
(on b3 b18)
(on-table b4)
(on-table b5)
(on b6 b4)
(on b7 b11)
(on b8 b3)
(on b9 b14)
(on b10 b15)
(on b11 b13)
(on-table b12)
(on b13 b20)
(on b14 b2)
(on b15 b19)
(on b16 b17)
(on b17 b9)
(on b18 b7)
(on b19 b22)
(on-table b20)
(on b21 b10)
(on b22 b12)
(clear b1)
(clear b6)
(clear b8)
(clear b16)
(clear b21)
)
(:goal
(and
(on b1 b4)
(on b2 b7)
(on b3 b8)
(on b7 b1)
(on b8 b18)
(on b9 b15)
(on b10 b21)
(on b11 b13)
(on b12 b3)
(on b13 b22)
(on b15 b11)
(on b16 b10)
(on b17 b14)
(on b18 b17)
(on b19 b6)
(on b22 b5))
)
)

; plan
1. (unstack b16 b17)
   deleted: (on b16 b17) (clear b16) (arm-empty)
   added: (holding b16) (clear b17)
   goals met: 1 of 16
2. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 1 of 16
3. (unstack b17 b9)
   deleted: (on b17 b9) (clear b17) (arm-empty)
   added: (holding b17) (clear b9)
   goals met: 1 of 16
4. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 16
5. (unstack b9 b14)
   deleted: (on b9 b14) (clear b9) (arm-empty)
   added: (holding b9) (clear b14)
   goals met: 1 of 16
6. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 1 of 16
7. (unstack b14 b2)
   deleted: (on b14 b2) (clear b14) (arm-empty)
   added: (holding b14) (clear b2)
   goals met: 1 of 16
8. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 1 of 16
9. (unstack b6 b4)
   deleted: (on b6 b4) (clear b6) (arm-empty)
   added: (holding b6) (clear b4)
   goals met: 1 of 16
10. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 1 of 16
11. (unstack b1 b5)
   deleted: (on b1 b5) (clear b1) (arm-empty)
   added: (holding b1) (clear b5)
   goals met: 1 of 16
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 16
13. (unstack b21 b10)
   deleted: (on b21 b10) (clear b21) (arm-empty)
   added: (holding b21) (clear b10)
   goals met: 1 of 16
14. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 1 of 16
15. (unstack b10 b15)
   deleted: (on b10 b15) (clear b10) (arm-empty)
   added: (holding b10) (clear b15)
   goals met: 1 of 16
16. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 16
17. (unstack b15 b19)
   deleted: (on b15 b19) (clear b15) (arm-empty)
   added: (holding b15) (clear b19)
   goals met: 1 of 16
18. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 16
19. (unstack b19 b22)
   deleted: (on b19 b22) (clear b19) (arm-empty)
   added: (holding b19) (clear b22)
   goals met: 1 of 16
20. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 16
21. (unstack b22 b12)
   deleted: (on b22 b12) (clear b22) (arm-empty)
   added: (holding b22) (clear b12)
   goals met: 1 of 16
22. (putdown b22)
   deleted: (holding b22)
   added: (clear b22) (arm-empty) (on-table b22)
   goals met: 1 of 16
23. (unstack b8 b3)
   deleted: (on b8 b3) (clear b8) (arm-empty)
   added: (holding b8) (clear b3)
   goals met: 1 of 16
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 1 of 16
25. (unstack b3 b18)
   deleted: (on b3 b18) (clear b3) (arm-empty)
   added: (holding b3) (clear b18)
   goals met: 1 of 16
26. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 16
27. (unstack b18 b7)
   deleted: (on b18 b7) (clear b18) (arm-empty)
   added: (holding b18) (clear b7)
   goals met: 1 of 16
28. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 1 of 16
29. (unstack b7 b11)
   deleted: (on b7 b11) (clear b7) (arm-empty)
   added: (holding b7) (clear b11)
   goals met: 1 of 16
30. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 16
31. (unstack b11 b13)
   deleted: (on b11 b13) (clear b11) (arm-empty)
   added: (holding b11) (clear b13)
   goals met: 0 of 16
32. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 0 of 16
33. (unstack b13 b20)
   deleted: (on b13 b20) (clear b13) (arm-empty)
   added: (holding b13) (clear b20)
   goals met: 0 of 16
34. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 16
35. (pickup b17)
   deleted: (clear b17) (on-table b17) (arm-empty)
   added: (holding b17)
   goals met: 0 of 16
36. (stack b17 b14)
   deleted: (clear b14) (holding b17)
   added: (arm-empty) (clear b17) (on b17 b14)
   goals met: 1 of 16
37. (pickup b18)
   deleted: (clear b18) (on-table b18) (arm-empty)
   added: (holding b18)
   goals met: 1 of 16
38. (stack b18 b17)
   deleted: (clear b17) (holding b18)
   added: (arm-empty) (clear b18) (on b18 b17)
   goals met: 2 of 16
39. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 2 of 16
40. (stack b8 b18)
   deleted: (clear b18) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b18)
   goals met: 3 of 16
41. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 16
42. (stack b3 b8)
   deleted: (clear b8) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b8)
   goals met: 4 of 16
43. (pickup b12)
   deleted: (clear b12) (on-table b12) (arm-empty)
   added: (holding b12)
   goals met: 4 of 16
44. (stack b12 b3)
   deleted: (clear b3) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b3)
   goals met: 5 of 16
45. (pickup b19)
   deleted: (clear b19) (on-table b19) (arm-empty)
   added: (holding b19)
   goals met: 5 of 16
46. (stack b19 b6)
   deleted: (clear b6) (holding b19)
   added: (arm-empty) (clear b19) (on b19 b6)
   goals met: 6 of 16
47. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 6 of 16
48. (stack b1 b4)
   deleted: (clear b4) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b4)
   goals met: 7 of 16
49. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 7 of 16
50. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 8 of 16
51. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 8 of 16
52. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 9 of 16
53. (pickup b22)
   deleted: (clear b22) (on-table b22) (arm-empty)
   added: (holding b22)
   goals met: 9 of 16
54. (stack b22 b5)
   deleted: (clear b5) (holding b22)
   added: (arm-empty) (clear b22) (on b22 b5)
   goals met: 10 of 16
55. (pickup b13)
   deleted: (clear b13) (on-table b13) (arm-empty)
   added: (holding b13)
   goals met: 10 of 16
56. (stack b13 b22)
   deleted: (clear b22) (holding b13)
   added: (arm-empty) (clear b13) (on b13 b22)
   goals met: 11 of 16
57. (pickup b11)
   deleted: (clear b11) (on-table b11) (arm-empty)
   added: (holding b11)
   goals met: 11 of 16
58. (stack b11 b13)
   deleted: (clear b13) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b13)
   goals met: 12 of 16
59. (pickup b15)
   deleted: (clear b15) (on-table b15) (arm-empty)
   added: (holding b15)
   goals met: 12 of 16
60. (stack b15 b11)
   deleted: (clear b11) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b11)
   goals met: 13 of 16
61. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 13 of 16
62. (stack b9 b15)
   deleted: (clear b15) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b15)
   goals met: 14 of 16
63. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 14 of 16
64. (stack b10 b21)
   deleted: (clear b21) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b21)
   goals met: 15 of 16
65. (pickup b16)
   deleted: (clear b16) (on-table b16) (arm-empty)
   added: (holding b16)
   goals met: 15 of 16
66. (stack b16 b10)
   deleted: (clear b10) (holding b16)
   added: (arm-empty) (clear b16) (on b16 b10)
   goals met: 16 of 16
